{
    "stories": [
        {
            "text": "During a trip to Rome, Italy in 2021, I met a man who told me I needed to create an API. After returning to the states, I enrolled in a coding bootcamp with one sole mission: learn to create an API. During bootcamp I created my first few projects including Password Generator and Budget Breaker",
            "image": "",
            "order": 1
        },
        {
            "text": "After completing the 6 month program, I became a terrible fake it until you make it full stack developer. But we all start somewhere right? So connecting to a free API, i created my first solo project: Love compatibility.",
            "image": "",
            "order": 2
        },
        {
            "text": "Shortly after, I recognized a new world of development - VR Development. I began to teach myself a new VR HTML language named A-frame and deployed my first enviornment.",
            "image": "",
            "order": 3
        },
        {
            "text": "Now I noticed the value in purchasing domain names. I now own more than 30. But the first one I bought was my own name (after a political smear campaign story I was told) - here is my very first portfolio prior to this one. This was also my first React portfolio.",
            "image": "",
            "order": 4
        },
        {
            "text": "Here is the part in my journey where digital art began. Creating custom domains and images, I began creating digital art porfolios.",
            "image": "",
            "order": 5
        },
        {
            "text": "This is where I began to solidify myself in React and Typescript and focused my growing efforts on these frameworks.",
            "image": "",
            "order": 6
        },
        {
            "text": "Now I know what you're thinking - at what point do you get good?! WELL...here we go. One day I woke up and things began to click within React and design.",
            "image": "",
            "order": 7
        },
        {
            "text": "This brings us to 2025, modern day. After creating a digital agency at the beginning of the year, I decided to rededicate my time to myself and my portfolio. I will continue to push out more projects, more github commits, and am currently learning Python. I will include a python project soon.",
            "image": "",
            "order": 8
        }
    ]
}