{
    "stories": [
        {
            "text": "During a trip to Rome, Italy in 2021, I met a man who told me I needed to create an API. After returning to the states, I enrolled in a coding bootcamp with one sole mission: learn to create an API. During bootcamp I created my first few projects including Password Generator and Budget Breaker",
            "image": "",
            "order": 1
        },
        {
            "text": "After completing the month program, I became an overly confident fake-it-until-you-make-it full stack developer. Using a free API, I created the project 'Love compatibility'. During this time, I mastered HTML and vanilla CSS.",
            "image": "",
            "order": 2
        },
        {
            "text": "Shortly after, I recognized a new world of development - VR Development. I began to teach myself a new VR HTML language named A-frame and deployed my first enviornment.",
            "image": "",
            "order": 3
        },
        {
            "text": "I quickly realized the importance of owning domain names after hearing about a political smear campaign story. This inspired me to purchase my first domain: my own name. Since then, I've acquired more than 30 domains. My very first React portfolio was then created, marking the beginning of my epic journey in web development.",
            "image": "",
            "order": 4
        },
        {
            "text": "Here is the part in my journey where digital art began. I started creating custom domains and digital art portfolios, designing unique images using Adobe Creative Cloud. To bring these creations to life, I began exploring frameworks like Framer Motion and AOS, showcasing digital images in innovative and dynamic ways.",
            "image": "",
            "order": 5
        },
  
        {
            "text": "Now I know what you're thinking - at what point do you get good?! One day I woke up and things began to click within React and design. There were a few projects from 2023 that deepened my fundamentals like these.",
            "image": "",
            "order": 6
        },
        {
            "text": "In 2023 I secured my first developer position at a church in Columbus, Ohio. By April 2024, I received a full ride ticket to the 2024 Las Vegas React Conference hosted by Meta and Callstack. This experience marked a turning point, as I made connections and solidified my expertise in frameworks like React and TypeScript.",
            "image": "",
            "order": 8
        },
        {
            "text": "This brings us to 2025, modern day. After creating a digital agency at the beginning of the year, I decided to rededicate my time to myself and my portfolio. I will continue to push out more projects, more github commits, and am currently learning Python. I will include a python project soon.",
            "image": "",
            "order": 7
        },
 
        {
            "text": "Thanks so much for viewing! Check out more information in my menu including links to some of my personal writings and images. I anticipate more projects like 'ProjectB' and 'Masks', as well as python projects in the future.",
            "image": "",
            "order": 9
        }
    ]
}